
&НаСервере
Процедура ПоменятьСтутасНаСервере()  
	
	НаборЗаписей = РегистрыСведений._СостоянияПредложенийИМ.СоздатьНаборЗаписей();
	
	Документ = Объект.Предложение;  
	
	НаборЗаписей.Отбор.Объект.Установить(Документ);          
	//++                                                                   
	Запись = НаборЗаписей.Добавить();
	Запись.Объект = Документ;
	Запись.ДатаИзменения = ТекущаяДатаСеанса();
	Запись.Состояние = Статусы; ///Создан; // СправочникСсылка.Валюты
	//--
	НаборЗаписей.Записать();
		
 КонецПроцедуры

&НаКлиенте
Процедура ПоменятьСтутас(Команда)
	ПоменятьСтутасНаСервере();
КонецПроцедуры
